#include <iostream>

using namespace std;

/*
Напишите программу, которая объявляет и инициализирует переменную
типа char с именем letter и присваивает ей значение ‘A’. Затем
выведите на экран код этого символа в ASCII-таблице.
*/

int main() {
    char letter = 'A';
    cout << int(letter) << endl;
    return 0;
}