#include <iostream>

using namespace std;

/*
Напишите программу, которая объявляет и инициализирует переменную типа
int с именем number и присваивает ей значение 42. Затем выведите
на экран значение этой переменной.
*/

int main() {
    int number = 42;
    cout << number << endl;
    return 0;
}