#include <cmath>
#include <iostream>

#define cubeof(x) (x * x * x)

using namespace std;

/*
Напишите программу, которая вычисляет с помощью макроса куб числа 10 — cubeof(X)
*/

int main() {
    int x = 10 ;
    cout << cubeof(x) << endl;
    return 0;
}
